tests/suite-1000-millis-sleep-test/120000-conc-4000/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /sleep/1000
Document Length:        27 bytes

Concurrency Level:      4000
Time taken for tests:   2121.824 seconds
Complete requests:      120000
Failed requests:        98283
   (Connect: 0, Receive: 0, Length: 98283, Exceptions: 0)
Non-2xx responses:      98283
Keep-Alive requests:    120000
Total transferred:      38034435 bytes
HTML transferred:       7171320 bytes
Requests per second:    56.56 [#/sec] (mean)
Time per request:       70727.461 [ms] (mean)
Time per request:       17.682 [ms] (mean, across all concurrent requests)
Transfer rate:          17.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3  14.3      0     114
Processing:  2127 69523 23781.1  68604  227930
Waiting:     2127 69523 23781.2  68604  227930
Total:       2127 69526 23777.9  68604  227930

Percentage of the requests served within a certain time (ms)
  50%  68604
  66%  80775
  75%  84249
  80%  87857
  90%  97349
  95%  105146
  98%  121965
  99%  128253
 100%  227930 (longest request)